microresearch/allcolours/software/STM32F103/src/stm32f10x_func_it.c
static uint8_t ghost_tapsH[32][4] = {
        {0, 0, 0, 0},
        {0, 0, 0, 0},
        {0, 0, 0, 0},
        {3, 2, 0, 0},
        {4, 3, 2, 1},
        {5, 4, 2, 1},
        {6, 5, 4, 3},
        {7, 5, 4, 3},
        {8, 7, 5, 4},
        {9, 8, 6, 5},
        {10, 9, 8, 6},
        {11, 10, 7, 5},
        {12, 11, 9, 8},
        {13, 12, 10, 8},
        {14, 13, 12, 10},
        {15, 13, 12, 10},
        {16, 15, 14, 13},
        {17, 16, 15, 12},
        {18, 17, 16, 13},
        {19, 18, 15, 13},
        {20, 19, 18, 15},
        {21, 18, 17, 16},
        {22, 21, 19, 17},
        {23, 22, 20, 19},
        {24, 23, 22, 21},
        {25, 24, 23, 19},
        {26, 25, 24, 21},
        {27, 26, 23, 21},
        {28, 27, 26, 24},
        {29, 28, 25, 23},
        {30, 29, 28, 27},
        {31, 29, 25, 24},
  };


static uint8_t lfsr_taps_mirrored[32][4] = {
        {0, 0, 0, 0},
        {0, 0, 0, 0},
        {0, 1, 1, 1},
        {3, 2, 2, 0},
        {4, 2, 1, 0},
        {5, 3, 2, 0},
        {6, 2, 1, 0},
        {7, 3, 2, 1},
        {8, 3, 2, 0},
        {9, 3, 2, 0},
        {10, 3, 1, 0},
        {11, 5, 3, 0},
        {12, 3, 2, 0},
        {13, 4, 2, 0},
        {14, 3, 1, 0},
        {15, 4, 2, 1},
        {16, 2, 1, 0},
        {17, 4, 1, 0},
        {18, 4, 1, 0},
        {19, 5, 3, 0},
        {20, 4, 1, 0},
        {21, 4, 3, 2},
        {22, 4, 2, 0},
        {23, 3, 2, 0},
        {24, 2, 1, 0},
        {25, 5, 1, 0},
        {26, 4, 1, 0},
        {27, 5, 3, 0},
        {28, 3, 1, 0},
        {29, 5, 3, 0},
        {30, 2, 1, 0},
        {31, 6, 5, 1},
	 };

static uint8_t ghost_tapsL[32][4] = {
        {0, 0, 0, 0},
        {0, 0, 0, 0},
        {0, 1, 1, 1},
        {3, 2, 2, 0},
        {4, 2, 1, 0},
        {5, 3, 2, 0},
        {6, 2, 1, 0},
        {7, 3, 2, 1},
        {8, 3, 2, 0},
        {9, 3, 2, 0},
        {10, 3, 1, 0},
        {11, 5, 3, 0},
        {12, 3, 2, 0},
        {13, 4, 2, 0},
        {14, 3, 1, 0},
        {15, 4, 2, 1},
        {16, 2, 1, 0},
        {17, 4, 1, 0},
        {18, 4, 1, 0},
        {19, 5, 3, 0},
        {20, 4, 1, 0},
        {21, 4, 3, 2},
        {22, 4, 2, 0},
        {23, 3, 2, 0},
        {24, 2, 1, 0},
        {25, 5, 1, 0},
        {26, 4, 1, 0},
        {27, 5, 3, 0},
        {28, 3, 1, 0},
        {29, 5, 3, 0},
        {30, 2, 1, 0},
        {31, 6, 5, 1},
	 };



// test for function pointers

/*
void CGS_one(void){  //->>>>>>>>>>>>>> 0- pulse clock in (PB7) toggles loopback to OR with new input bit (PB10) /or just accept new input bit (CGS)
  bith = (shift_registerh>>SRlengthh) & 0x01; // bit which would be shifted out

	if (GPIOB->IDR & 0x0080) shift_registerh = (shift_registerh<<1) + (!(GPIOB->IDR & 0x0400)); // 0x0080 is clock bit in!
	else shift_registerh = (shift_registerh<<1) + (bith | (!(GPIOB->IDR & 0x0400))); 

	// shift register bits output - inverted on PC13 and 14;
	if (bith) GPIOC->BRR = 0b0010000000000000;  // clear PC13 else write one
	else GPIOC->BSRR = 0b0010000000000000;  
	if (shift_registerh & lengthbith) GPIOC->BRR = 0b0100000000000000;  // clear PC14 else write one BRR is clear, BSRR is set bit and leave alone others
	else GPIOC->BSRR = 0b0100000000000000; 
}

void (*HF_TIM2_modes[8])(void)={CGS_one, CGS_one, CGS_one, CGS_one, CGS_one, CGS_one, CGS_one, CGS_one};
*/

// run with HF_TIM2_modes[modehsr]();


	void case_0(void){
	  uint8_t bitl;
      //->>>>>>>>>>>>>> 0- pulse (PB5) toggles loopback to OR with new input bit (PB6) /or just accept new input bit (CGS)
      bitl = (shift_registerl>>SRlengthl) & 0x01; // bit which would be shifted out

      if (GPIOB->IDR & 0x0020) shift_registerl= (shift_registerl<<1) + (!(GPIOB->IDR & 0x0040)); // switched around for speed
      else shift_registerl = (shift_registerl<<1) + (bitl | !(GPIOB->IDR & 0x0040)); // PB5 and PB6
      // shift register bits output - inverted on PB13 and 14;
      	
	if (bitl) GPIOB->BRR = 0b0010000000000000;  // clear PB13 else write one
	else GPIOB->BSRR = 0b0010000000000000;  
	if (shift_registerl & lengthbitl) GPIOB->BRR = 0b0100000000000000;  // clear PB14 else write one BRR is clear, BSRR is set bit and leave alone others
	else GPIOB->BSRR = 0b0100000000000000;  
      	}
	
    void case_1(void){
      	  uint8_t bitl;
	//->>>>>>>>>>>>>> 1- pulse (PB5) toggles loopback to XOR with new input bit (PB6) /or just accept new input bit (CGS)
	bitl = (shift_registerl>>SRlengthl) & 0x01; // bit which would be shifted out -
    
	if (GPIOB->IDR & 0x0020) shift_registerl = (shift_registerl<<1) + (!(GPIOB->IDR & 0x0040));
	else shift_registerl = (shift_registerl<<1) + ((bitl ^ !(GPIOB->IDR & 0x0040)));

	if (bitl) GPIOB->BRR = 0b0010000000000000;  // clear PC13 else write one
	else GPIOB->BSRR = 0b0010000000000000; 
	if (shift_registerl & lengthbitl) GPIOB->BRR = 0b0100000000000000;  
	else GPIOB->BSRR = 0b0100000000000000; 
	}
    
      void case_2(void){
	uint8_t bitl;
	//->>>>>>>>>>>>>> 2- loopback ORed with input bit and pulses flip/leak bits INSIDE the SR selected with counter and pulse
	lcount++;
	if (lcount>SRlengthl) lcount=0;
	bitl = (shift_registerl>>SRlengthl) & 0x01; // bit which would be shifted out 

	shift_registerl= (shift_registerl<<1) + (bitl | !(GPIOB->IDR & 0x0040));

	if( !(GPIOB->IDR & 0x0020)) shift_registerl ^= (1<<lcount); // if we have pulse and lcount then flip that bit inside SR... rest all the same...

	if (bitl) GPIOB->BRR = 0b0010000000000000;  // clear PC13 else write one
	else GPIOB->BSRR = 0b0010000000000000; 
	if (shift_registerl & lengthbitl) GPIOB->BRR = 0b0100000000000000;  
	else GPIOB->BSRR = 0b0100000000000000; 
	}
    
      void case_3(void){ //*
		uint8_t bitl;
	//->>>>>>>>>>>>>> 3- pulse(1) inverts the cycling bit in - this is Turing Machine - cycle bit or invert bit (**no extra input bit is used)
	bitl = (shift_registerl>>SRlengthl) & 0x01; // bit which would be shifted out 
	if (GPIOB->IDR & 0x0020) shift_registerl = (shift_registerl<<1) + bitl;
	else shift_registerl = (shift_registerl<<1) + (!bitl);

	if (bitl) GPIOB->BRR = 0b0010000000000000;  // clear PC13 else write one
	else GPIOB->BSRR = 0b0010000000000000; 
	if (shift_registerl & lengthbitl) GPIOB->BRR = 0b0100000000000000;  
	else GPIOB->BSRR = 0b0100000000000000; 
	}

      void case_4(void){
	uint8_t bitl;
	//->>>>>>>>>>>>>> 4- parity for loopback XOR is determined by pulsed bits in -> select bits with pulse and queue 
	lcount++;
	if (lcount>SRlengthl) lcount=0;
	if( !(GPIOB->IDR & 0x0020)) {
	  lstack[3]=lstack[2];
	  lstack[2]=lstack[1];
	  lstack[1]=lstack[0];
	  lstack[0]=lcount+1; // bump it on to the lstack
	}	  

	bitl= ((shift_registerl >> lstack[0]) ^ (shift_registerl >> lstack[1]) ^ (shift_registerl >> lstack[2]) ^ (shift_registerl >> lstack[3])) & 1u; // 32 is 31, 29, 25, 24
	shift_registerl= (shift_registerl<<1) + (bitl | !(GPIOB->IDR & 0x0040)); // TESTY - to OR in new bit or not?

	if (bitl) GPIOB->BRR = 0b0010000000000000;  // clear PC13 else write one
	else GPIOB->BSRR = 0b0010000000000000; 
	if (shift_registerl & lengthbitl) GPIOB->BRR = 0b0100000000000000;  
	else GPIOB->BSRR = 0b0100000000000000; 
	}

    void case_5(void){ // was 7
      	uint8_t bitl;
	//->>>>>>>>>>>>>> 7- electronotes: bits of the first SR determine (via NAND) if we recycle 2nd SR, or add new bit from the first SR - no input needed Q of lengths?
	// no use of in bit
	// !note: swop l and h when port to low!
	bitl = (shift_registerl>>SRlengthl) & 0x01; // bit which would be shifted out -
	if (lcount>7) lcount=0;
	if( !(GPIOB->IDR & 0x0020)) probl^=(1<<lcount);
	lcount++;
	if (((probl | shift_registerl) & 0xff ) == 0xff) shift_registerl = (shift_registerl<<1) + ((shift_registerh>>SRlengthl) & 0x01); // fixed for swop
	else shift_registerl = (shift_registerl<<1) + bitl;

	if (bitl) GPIOB->BRR = 0b0010000000000000;  // clear PC13 else write one
	else GPIOB->BSRR = 0b0010000000000000; 
	if (shift_registerl & lengthbitl) GPIOB->BRR = 0b0100000000000000; 
	else GPIOB->BSRR = 0b0100000000000000; 
	}

    void case_6(void){ // was 9
      	uint8_t bitl;
	// 9- LFSR noise only with varying taps depending on length with new bit ORed in depending on pulse - for LF we can do mirroring!
	if (shift_registerl==0) shift_registerl=0xff; // catch it!
	bitl= ((shift_registerl >> (lfsr_taps_mirrored[SRlengthl][0])) ^ (shift_registerl >> (lfsr_taps_mirrored[SRlengthl][1])) ^ (shift_registerl >> (lfsr_taps_mirrored[SRlengthl][2])) ^ (shift_registerl >> (lfsr_taps_mirrored[SRlengthl][3]))) & 1u; // 32 is 31, 29, 25, 24
	if (GPIOB->IDR & 0x0020) shift_registerl = (shift_registerl<<1) + bitl;
	else shift_registerl = (shift_registerl<<1) + (bitl | !(GPIOB->IDR & 0x0040)); 

	if (bitl) GPIOB->BRR = 0b0010000000000000;  // clear PC13 else write one
	else GPIOB->BSRR = 0b0010000000000000;  
	if (shift_registerl & lengthbitl) GPIOB->BRR = 0b0100000000000000;  // clear PC14 else write one BRR is clear, BSRR is set bit and leave alone others
	else GPIOB->BSRR = 0b0100000000000000;  
	}

    void case_7(void){ //was 23 -  experimental modes 23+ here and 32+ in pulses - TESTED/WORKING!
      	uint8_t bitl;
	// shifting the array of LFSR taps = ghost_tapsH on the high side
	// clock pulse shifts one selected by pulse 
	if (!(GPIOB->IDR & 0x0020)) lcount++;
	if (lcount>3) lcount=0;
	if (!(GPIOB->IDR & 0x0040)) {
	  ghost_tapsL[SRlengthl][lcount+1]+=1;
	  ghost_tapsL[SRlengthl][lcount+1]%=SRlengthl;
	}
	
	if (shift_registerl==0) shift_registerl=0xff; // catch it!
	bitl= ((shift_registerl >> (ghost_tapsL[SRlengthl][0])) ^ (shift_registerl >> (ghost_tapsL[SRlengthl][1])) ^ (shift_registerl >> (ghost_tapsL[SRlengthl][2])) ^ (shift_registerl >> (ghost_tapsL[SRlengthl][3]))) & 1u; // 32 is 31, 29, 25, 24
	shift_registerl = (shift_registerl<<1) + bitl;
	
	if (bitl) GPIOB->BRR = 0b0010000000000000;  // clear PC13 else write one
	else GPIOB->BSRR = 0b0010000000000000;  
	if (shift_registerl & lengthbitl) GPIOB->BRR = 0b0100000000000000;  // clear PC14 else write one BRR is clear, BSRR is set bit and leave alone others
	else GPIOB->BSRR = 0b0100000000000000;  
	}

    void case_8(void){ // was 30
      	uint8_t bitl;
	//->>>>>>>>>>>>>> 3- pulse(1) inverts the cycling bit in - this is Turing Machine - cycle bit or invert bit (**no extra input bit is used)-> our 3 options if we have a bit 0x0020
	// - TESTED/WORKING!
	bitl = (shift_registerl>>SRlengthl) & 0x01; // bit which would be shifted out 
	if (GPIOB->IDR & 0x0040) shift_registerl = (shift_registerl<<1) + bitl;
	else shift_registerl = (shift_registerl<<1) + (!bitl);

	if (!(GPIOB->IDR & 0x0020)){
	if (bitl) GPIOB->BRR = 0b0010000000000000;  // clear PC13 else write one
	else GPIOB->BSRR = 0b0010000000000000; 
	if (shift_registerl & lengthbitl) GPIOB->BRR = 0b0100000000000000;  
	else GPIOB->BSRR = 0b0100000000000000;
	}
	}

    void case_9(void){ // was 32
      	uint8_t bitl;
	// extra mode in which (both) pulse on is triggered by bitl but gated off by input bit or pulse - but do we need like a toggle?????
	//-BASE it on::: >>>>>>>>>>>>>> 3- pulse(1) inverts the cycling bit in - this is Turing Machine - cycle bit or invert bit (**no extra input bit is used)
	// - TESTED/WORKING!
	
	bitl = (shift_registerl>>SRlengthl) & 0x01; // bit which would be shifted out 
	if (GPIOB->IDR & 0x0020) shift_registerl = (shift_registerl<<1) + bitl;
	else shift_registerl = (shift_registerl<<1) + (!bitl);

	if (bitl) GPIOB->BRR = 0b0010000000000000;  // clear PC13 else write one
	else if (!(GPIOB->IDR & 0x0040)) GPIOB->BSRR = 0b0010000000000000; 
	if (shift_registerl & lengthbitl) GPIOB->BRR = 0b0100000000000000;  
	else if (!(GPIOB->IDR & 0x0040)) GPIOB->BSRR = 0b0100000000000000; 
	}

      void case_10(void){ // was 33 - and invert the above
		uint8_t bitl;
	// extra mode in which (both) pulse on is triggered by bitl but gated off by input bit or pulse - but do we need like a toggle?????
	//-BASE it on::: >>>>>>>>>>>>>> 3- pulse(1) inverts the cycling bit in - this is Turing Machine - cycle bit or invert bit (**no extra input bit is used)
	// - TESTED/WORKING!
	
	bitl = (shift_registerl>>SRlengthl) & 0x01; // bit which would be shifted out 
	if (GPIOB->IDR & 0x0020) shift_registerl = (shift_registerl<<1) + bitl;
	else shift_registerl = (shift_registerl<<1) + (!bitl);

	if (bitl) GPIOB->BSRR = 0b0010000000000000;  // clear PC13 else write one
	else if (!(GPIOB->IDR & 0x0040)) GPIOB->BRR = 0b0010000000000000; 
	if (shift_registerl & lengthbitl) GPIOB->BSRR = 0b0100000000000000;  
	else if (!(GPIOB->IDR & 0x0040)) GPIOB->BRR = 0b0100000000000000; 
	}
	
    void case_11(void){ // was 34
      	uint8_t bitl;
	// extra modes use pulse or input bit as length of SR controller: see mode 42 below
	/// length thing	
	// - TESTED/WORKING!
	lcount++;
      if (lcount>31) lcount=4;
      if (!(GPIOB->IDR & 0x0020)) {
	SRlengthl=lcount;
	lengthbitl=(1<<(SRlengthl/2));
	}
      // as mode 3::::
      bitl = (shift_registerl>>SRlengthl) & 0x01; // bit which would be shifted out 
	if (GPIOB->IDR & 0x0040) shift_registerl = (shift_registerl<<1) + bitl;
	else shift_registerl = (shift_registerl<<1) + (!bitl);

	if (bitl) GPIOB->BRR = 0b0010000000000000;  // clear PC13 else write one
	else GPIOB->BSRR = 0b0010000000000000; 
	if (shift_registerl & lengthbitl) GPIOB->BRR = 0b0100000000000000;  
	else GPIOB->BSRR = 0b0100000000000000; 
	}
	
    void case_12(void){ // was 35
      	uint8_t bitl;
	// Independent LFSR clocking regular SR (only in CV as speed) - TESTED/WORKING!
	// can use input bit as length of either SR = here is regularSR
	// works well
	lcount++;
	if (lcount>31) lcount=4;
	if (!(GPIOB->IDR & 0x0020)) {
	  SRlengthl=lcount;
	  lengthbitl=(1<<(SRlengthl/2));
	}
	
