microresearch/allcolours/software/STM32F103/src/stm32f10x_func_it.c
      void case_15h(void){ // was 41
	uint8_t bith;
	// pulse in means double a step..
	bith = (shift_registerh>>SRlengthh) & 0x01; // bit which would be shifted out 
	if (GPIOB->IDR & 0x0400) shift_registerh = (shift_registerh<<1) + bith;
	else shift_registerh = (shift_registerh<<1) + (!bith);

	if (!(GPIOB->IDR & 0x0080)) {
	bith = (shift_registerh>>SRlengthh) & 0x01; // bit which would be shifted out 
	if (GPIOB->IDR & 0x0400) shift_registerh = (shift_registerh<<1) + bith;
	else shift_registerh = (shift_registerh<<1) + (!bith);
	}
	
	if (bith) GPIOC->BRR = 0b0010000000000000;  // clear PC13 else write one
	else GPIOC->BSRR = 0b0010000000000000; 
	if (shift_registerh & lengthbith) GPIOC->BRR = 0b0100000000000000;  
	else GPIOC->BSRR = 0b0100000000000000; 	
	}	


	void case_16(void){ // was 11 - leave in middle// MAYBE put this in middle of CV select mode for easy access TODO
      //->>>>>>>>>>>>>> CV selects length of SR which will stay with us .. -> LFSR here
	  uint8_t bitl;
	  uint32_t clvalue;	  
	  if (modelpwm==0) clvalue=65536-ADCBuffer[3];  
	  else clvalue=ADCBuffer[3];

      SRlengthl=31-(clvalue>>11);
      if (SRlengthl<4) SRlengthl=4;
      lengthbitl=(1<<(SRlengthl/2));
      if (shift_registerl==0) shift_registerl=0xff;
      bitl= ((shift_registerl >> (lfsr_taps_mirrored[SRlengthl][0])) ^ (shift_registerl >> (lfsr_taps_mirrored[SRlengthl][1])) ^ (shift_registerl >> (lfsr_taps_mirrored[SRlengthl][2])) ^ (shift_registerl >> (lfsr_taps_mirrored[SRlengthl][3]))) & 1u; // 32 is 31, 29, 25, 24
      shift_registerl = (shift_registerl<<1) + ((bitl | !(GPIOB->IDR & 0x0040))); // PB7 and PB10

      if (bitl) GPIOB->BRR = 0b0010000000000000;  // clear PC13 else write one
      else GPIOB->BSRR = 0b0010000000000000;  
      if (shift_registerl & lengthbitl) GPIOB->BRR = 0b0100000000000000; 
      else GPIOB->BSRR = 0b0100000000000000;  
      }

    void case_17(void){ // was 10
      	  uint8_t bitl;
	  uint32_t clvalue;
	  if (modelpwm==0) clvalue=65536-ADCBuffer[3];  
	  else clvalue=ADCBuffer[3];

      //->>>>>>>>>>>>>> entry into SR from CV - TM = no input bit 
      lcount++;
      if (lcount>7) lcount=0;
      bitl = (shift_registerl>>SRlengthl) & 0x01; // bit which would be shifted out
      
      if((clvalue>>(8+lcount))&1) shift_registerl = (shift_registerl<<1) + (!bitl); // or we could & with input bit - TO TEST!
      else shift_registerl = (shift_registerl<<1) + bitl;

      if (bitl) GPIOB->BRR = 0b0010000000000000;  // clear PC13 else write one
      else GPIOB->BSRR = 0b0010000000000000; 
      if (shift_registerl & lengthbitl) GPIOB->BRR = 0b0100000000000000; 
      else GPIOB->BSRR = 0b0100000000000000; 
      }
      
    void case_18(void){ // was 12 - works fine with cv in
      	  uint8_t bitl;
	    uint32_t clvalue;
	  if (modelpwm==0) clvalue=65536-ADCBuffer[3];  
	  else clvalue=ADCBuffer[3];

      //->>>>>>>>>>>>>> NEW mode TESTY: entry of ADC in from CV into upper bits?
      bitl = (shift_registerl>>SRlengthl) & 0x01; // bit which would be shifted out

      if (counter12l == 9){       // every 8 cycles
	counter12l=0;
	shift_registerl &= MASK[SRlengthl]; // MASK is the INVERTED one eg. ~(Oxff) for bottom 8 bits - bottom/lower is where SR is for lower lengths
	shift_registerl +=(clvalue>>8)<<(SHIFT[SRlengthl]); 
      }
      counter12l++;

      shift_registerl=(shift_registerl<<1) + (bitl |  (!(GPIOB->IDR & 0x0040))); // cycle around and OR in pulse bit! TESTY!

      if (bitl) GPIOB->BRR = 0b0010000000000000;  // clear PC13 else write one
      else GPIOB->BSRR = 0b0010000000000000; 
      if (shift_registerl & lengthbitl) GPIOB->BRR = 0b0100000000000000;  // clear PC14 else write one BRR is clear, BSRR is set bit and leave alone others
      else GPIOB->BSRR = 0b0100000000000000; 
      }

    void case_19(void){ // was 13
      	  uint8_t bitl;
	    uint32_t clvalue;
	  if (modelpwm==0) clvalue=65536-ADCBuffer[3];  
	  else clvalue=ADCBuffer[3];

      //->>>>>>>>>>>>>> Electronotes: CV selects which bits to set to 1 = chance of change
      // we do not use bit IN!
      bitl = (shift_registerl>>SRlengthl) & 0x01; // bit which would be shifted out -
      probl=clvalue>>13; // 3 bits now for electroprob array
      probl=electroprob[probl];

      if (((probl | shift_registerl) & 0xff ) == 0xff) shift_registerl = (shift_registerl<<1) + ((shift_registerl>>SRlengthl) & 0x01); // new bits enter from shiftregleft - 0xff was looker[7]
      else shift_registerl = (shift_registerl<<1) + bitl;

      if (bitl) GPIOB->BRR = 0b0010000000000000;  // clear PC13 else write one
      else GPIOB->BSRR = 0b0010000000000000; 
      if (shift_registerl & lengthbitl) GPIOB->BRR = 0b0100000000000000;  // clear PC14 else write one BRR is clear, BSRR is set bit and leave alone others
      else GPIOB->BSRR = 0b0100000000000000; 
      }

    void case_20(void){ // was 14 - could replace mode or one of these ???
      uint8_t bitl, numflips, x;
      uint32_t clvalue;
	  if (modelpwm==0) clvalue=65536-ADCBuffer[3];  
	  else clvalue=ADCBuffer[3];

      //->>>>>>>>>>>>>> uses CV as speed/flipflop/clock divider
      // pulse in inverts the cycling bit in a la Turing Machine - cycle bit or invert bit = thus we do use input bit
      bitl = (shift_registerl>>SRlengthl) & 0x01; // bit which would be shifted out
      //      origbitl=bitl;
      if (GPIOB->IDR & 0x0040) shift_registerl =  (shift_registerl<<1) + bitl;
      else shift_registerl = (shift_registerl<<1) + (!bitl);

      // flip flop: rising edge - if last was 0 and now is 1 then we trigger flip 1-0 or 0-1
      numflips=(clvalue>>12); //or 15-(clvalue>>12) if we wish it to go in the opposite direction
      new_statel[0]=bitl;
      if (prev_statel[0]==0 && new_statel[0]==1) flippedl[0]^=1;
      prev_statel[0]=new_statel[0];	

      for (x=1;x<numflips;x++){ 
	new_statel[x]=flippedl[x-1];
	if (prev_statel[x]==0 && new_statel[x]==1) flippedl[x]^=1;
	prev_statel[x]=new_statel[x];
      }
      if (numflips>0)	bitl=flippedl[numflips-1];

      if (bitl) GPIOB->BRR = 0b0010000000000000;  // clear PC13 else write one
      else GPIOB->BSRR = 0b0010000000000000;
      //      if (origbitl) GPIOB->BRR = 0b0100000000000000;  // original bitl 
      //      else GPIOB->BSRR = 0b0100000000000000;
      if (shift_registerl & lengthbitl) {
	if (bitl)	GPIOB->BRR = 0b0100000000000000;  // clear PC14 else write one BRR is clear, BSRR is set bit and leave alone others
      else GPIOB->BSRR = 0b0100000000000000;
      }
      }
	
