microresearch/allcolours/software/STM32F103/src/stm32f10x_func_it.c
    void case_21(void){ // was 15
      uint8_t bitl, numflips, x;
	  uint32_t clvalue;
	  if (modelpwm==0) clvalue=65536-ADCBuffer[3];  
	  else clvalue=ADCBuffer[3];

      //->>>>>>>>>>>>>> as mode 14=speed divider with XOR rungler: XOR out with input bit
      bitl = (shift_registerl>>SRlengthl) & 0x01; // bit which would be shifted out
      //      origbitl=bitl;
      shift_registerl = (shift_registerl<<1) + ((bitl) ^ (!(GPIOB->IDR & 0x0040)));

      numflips=(clvalue>>12); //or 15-(clvalue>>12) if we wish it to go in the opposite direction
      new_statel[0]=bitl;
      if (prev_statel[0]==0 && new_statel[0]==1) flippedl[0]^=1;
      prev_statel[0]=new_statel[0];	

      for (x=1;x<numflips;x++){ 
	new_statel[x]=flippedl[x-1];
	if (prev_statel[x]==0 && new_statel[x]==1) flippedl[x]^=1;
	prev_statel[x]=new_statel[x];
      }
      if (numflips>0)	bitl=flippedl[numflips-1];
      
      if (bitl) GPIOB->BRR = 0b0010000000000000;  // clear PC13 else write one
      else GPIOB->BSRR = 0b0010000000000000;
      if (shift_registerl & lengthbitl) {
	if (bitl)	GPIOB->BRR = 0b0100000000000000;  // clear PC14 else write one BRR is clear, BSRR is set bit and leave alone others
	else GPIOB->BSRR = 0b0100000000000000;
      }
      //      if (origbitl) GPIOB->BRR = 0b0100000000000000;  // original bitl 
      //      else GPIOB->BSRR = 0b0100000000000000;
      }

    void case_22(void){ // was 43
      	  uint8_t bitl;
	  uint32_t clvalue;
	  if (modelpwm==0) clvalue=65536-ADCBuffer[3];  
	  else clvalue=ADCBuffer[3];

      // as above but other way round with CV for length and incoming bits for probability of TM
      bitl = (shift_registerl>>SRlengthl) & 0x01; // bit which would be shifted out -

      SRlengthl=31-(clvalue>>11);
      if (SRlengthl<4) SRlengthl=4;
      lengthbitl=(1<<(SRlengthl/2));

      if (lcount>7) lcount=0;
      if( !(GPIOB->IDR & 0x0040)) probl^=(1<<lcount);
      lcount++;
      
      if (((probl | shift_registerh) & 0xff ) == 0xff) shift_registerl = (shift_registerl<<1) + bitl;
      else shift_registerl = (shift_registerl<<1) + (!bitl);
      
      if (bitl) GPIOB->BRR = 0b0010000000000000;  // clear PC13 else write one
      else GPIOB->BSRR = 0b0010000000000000;  
      if (shift_registerl & lengthbitl) GPIOB->BRR = 0b0100000000000000; 
      else GPIOB->BSRR = 0b0100000000000000;  
      }
      
    void case_23(void){ // was 44
      	  uint8_t bitl;
	  uint32_t clvalue;
	  if (modelpwm==0) clvalue=65536-ADCBuffer[3];  
	  else clvalue=ADCBuffer[3];

      // as mode 10 
      //->>>>>>>>>>>>>> entry into SR from CV - TM = no input bit = 1st option of above... - *more maybe on LF side these ones*
      // - TESTED/WORKING!
      if (!(GPIOB->IDR & 0x0040)){
	lcount++;
	if (lcount>7) lcount=0;
	bitl = (shift_registerl>>SRlengthl) & 0x01; // bit which would be shifted out
	if((clvalue>>(8+lcount))&1) shift_registerl = (shift_registerl<<1) + (!bitl); // or we could & with input bit - TO TEST!
	else shift_registerl = (shift_registerl<<1) + bitl;

	if (bitl) GPIOB->BRR = 0b0010000000000000;  // clear PC13 else write one
	else GPIOB->BSRR = 0b0010000000000000; 
	if (shift_registerl & lengthbitl) GPIOB->BRR = 0b0100000000000000; 
	else GPIOB->BSRR = 0b0100000000000000;
      }
	}

    void case_24(void){ // was 45
      	  uint8_t bitl;
	    uint32_t clvalue;
	  if (modelpwm==0) clvalue=65536-ADCBuffer[3];  
	  else clvalue=ADCBuffer[3];

      //->>>>>>>>>>>>>> entry into SR from CV - TM = no input bit = 3rd option of above...
      	// - TESTED/WORKING!
      lcount++;
      if (lcount>7) lcount=0;
	bitl = (shift_registerl>>SRlengthl) & 0x01; // bit which would be shifted out
	if((clvalue>>(8+lcount))&1) shift_registerl = (shift_registerl<<1) + (!bitl); // or we could & with input bit - TO TEST!
	else shift_registerl = (shift_registerl<<1) + bitl;

	if (!(GPIOB->IDR & 0x0040)){
	if (bitl) GPIOB->BRR = 0b0010000000000000;  // clear PC13 else write one
	else GPIOB->BSRR = 0b0010000000000000; 
	if (shift_registerl & lengthbitl) GPIOB->BRR = 0b0100000000000000; 
	else GPIOB->BSRR = 0b0100000000000000;
      }
	}

    void case_25(void){ // was 47
      	  uint8_t bitl;
	  uint32_t clvalue;
	  if (modelpwm==0) clvalue=65536-ADCBuffer[3];  
	  else clvalue=ADCBuffer[3];

      // *we could use CV to set length of pulse (say up to 128 which is 7 bits >> 9)*
      //->>>>>>>>>>>>>> as mode 14=speed divider with XOR rungler: XOR out with input bit
      	// - TESTED/WORKING! - not so exciting ....
      bitl = (shift_registerl>>SRlengthl) & 0x01; // bit which would be shifted out
      shift_registerl = (shift_registerl<<1) + ((bitl) ^ (!(GPIOB->IDR & 0x0040)));
      
	if (bitl) {
	  GPIOB->BRR = 0b0010000000000000; 
	  delay(clvalue>>9); // 64=10uS - short = lower voltage...
	  GPIOB->BSRR = 0b0010000000000000;  
	}
	  
	if (shift_registerl & lengthbitl) {
	  GPIOB->BRR = 0b0100000000000000;  
	  delay(clvalue>>9); // 64=10uS
	  GPIOB->BSRR = 0b0100000000000000;  
	  }
      }

    void case_26(void){ // was 51
      	  uint8_t bitl;
	  uint32_t clvalue;
	  if (modelpwm==0) clvalue=65536-ADCBuffer[3];  
	  else clvalue=ADCBuffer[3];

      //->>>>>>>>>>>>>> Electronotes: CV selects which bits to set to 1 = chance of change
      // TESTED/WORKING!
      bitl = (shift_registerl>>SRlengthl) & 0x01; // bit which would be shifted out -
      probl=clvalue>>13; // 3 bits now for electroprob array
      probl=electroprob[probl];

      if (((probl | shift_registerh) & 0xff ) == 0xff) shift_registerl = (shift_registerl<<1) + ((shift_registerh>>SRlengthh) & 0x01); 
      else shift_registerl = (shift_registerl<<1) + bitl;

      if (!(GPIOB->IDR & 0x0040)){
	if (bitl) GPIOB->BRR = 0b0010000000000000;  // clear PC13 else write one
	else GPIOB->BSRR = 0b0010000000000000; 
	if (shift_registerl & lengthbitl) GPIOB->BRR = 0b0100000000000000;  // clear PC14 else write one BRR is clear, BSRR is set bit and leave alone others
	else GPIOB->BSRR = 0b0100000000000000; 
      }
      }

    void case_27(void){ // was 52
      	  uint8_t bitl;
	  uint32_t clvalue;
	  if (modelpwm==0) clvalue=65536-ADCBuffer[3];  
	  else clvalue=ADCBuffer[3];

      //->>>>>>>>>>>>>> Electronotes: CV selects which bits to set to 1 = chance of change
      // TESTED/WORKING!
      if (!(GPIOB->IDR & 0x0040)){
      bitl = (shift_registerl>>SRlengthl) & 0x01; // bit which would be shifted out -
      probl=clvalue>>13; // 3 bits now for electroprob array
      probl=electroprob[probl];

      if (((probl | shift_registerh) & 0xff ) == 0xff) shift_registerl = (shift_registerl<<1) + ((shift_registerh>>SRlengthh) & 0x01); 
      else shift_registerl = (shift_registerl<<1) + bitl;
      }
      
      if (bitl) GPIOB->BRR = 0b0010000000000000;  // clear PC13 else write one
      else GPIOB->BSRR = 0b0010000000000000; 
      if (shift_registerl & lengthbitl) GPIOB->BRR = 0b0100000000000000;  // clear PC14 else write one BRR is clear, BSRR is set bit and leave alone others
      else GPIOB->BSRR = 0b0100000000000000; 
      }

