microresearch/allcolours/software/STM32F103/src/stm32f10x_func_it.c
    void case_28(void){ // was 53
      	  uint8_t bitl;
	  uint32_t clvalue;
	  if (modelpwm==0) clvalue=65536-ADCBuffer[3];  
	  else clvalue=ADCBuffer[3];

      // - after void case_25 - SR loops within SR at certain points?/sizes determined by CV or pulses in = basic SR of OR with incoming bits
      // change and Re_test this - TESTED/working
      // loop bitl back in XOR at certain point?
	bitl = (shift_registerl>>SRlengthl) & 0x01; // bit which would be shifted out
	shift_registerl = (shift_registerl<<1);
	// do the loop back in
	lcount=clvalue>>11; // 5 bits - or(void){ lcount=(clvalue>>11)%(SRlengthl+1);
	if (bitl) shift_registerl ^= (1<<lcount);// set the xth bit
	shift_registerl ^= (!(GPIOB->IDR & 0x0040));
	
	if (bitl) GPIOB->BRR = 0b0010000000000000;  // clear PC13 else write one
	else GPIOB->BSRR = 0b0010000000000000; 
	if (shift_registerl & lengthbitl) GPIOB->BRR = 0b0100000000000000;  
	else GPIOB->BSRR = 0b0100000000000000; 
	}
	
    void case_29(void){ // was 56
      	  uint8_t bitl;
	  uint32_t clvalue;
	  if (modelpwm==0) clvalue=65536-ADCBuffer[3];  
	  else clvalue=ADCBuffer[3];

      // Independent LFSR clocking regular SR (only in CV as speed) - TESTED/WORKING!
      // can use CV as length of either SR = here is regularSR
      //       - TESTED/working
      SRlengthl=(clvalue>>11);
      if (SRlengthl<4) SRlengthl=4;
      lengthbitl=(1<<(SRlengthl/2));
	
	if (shift_registerxl==0) shift_registerxl=0xff; // catch it!
	//	bitl= ((shift_registerl >> (lfsr_taps_mirrored[SRlengthl][0])) ^ (shift_registerl >> (lfsr_taps_mirrored[SRlengthl][1])) ^ (shift_registerl >> (lfsr_taps_mirrored[SRlengthl][2])) ^ (shift_registerl >> (lfsr_taps_mirrored[SRlengthl][3]))) & 1u; // 32 is 31, 29, 25, 24
	bitl= ((shift_registerxl >> 31) ^ (shift_registerxl >> 29) ^ (shift_registerxl >> 25) ^ (shift_registerxl >> 24)) & 1u; // 32 is 31, 29, 25, 24
	shift_registerxl = (shift_registerxl<<1) + bitl; // could or with incoming as we don't use this TESTY: shift_registerxl = (shift_registerx<<1) + (bitl | !(GPIOB->IDR & 0x0040)); 

	if (bitl){ // calculate and output new bitl with void case_3 Turing Machine(void){
	  bitl = (shift_registerl>>SRlengthl) & 0x01; // bit which would be shifted out 
	  if (GPIOB->IDR & 0x0040) shift_registerl = (shift_registerl<<1) + bitl;
	  else shift_registerl = (shift_registerl<<1) + (!bitl);

	  if (bitl) GPIOB->BRR = 0b0010000000000000;  // clear PC13 else write one
	  else GPIOB->BSRR = 0b0010000000000000;  
	  if (shift_registerl & lengthbitl) GPIOB->BRR = 0b0100000000000000;  // clear PC14 else write one BRR is clear, BSRR is set bit and leave alone others
	  else GPIOB->BSRR = 0b0100000000000000;
	}
	}

    void case_30(void){ // was 57
      uint8_t bitl, SRlengthx;
	  uint32_t clvalue;
	  if (modelpwm==0) clvalue=65536-ADCBuffer[3];  
	  else clvalue=ADCBuffer[3];

      // Independent LFSR clocking regular SR (only in CV as speed) - TESTED/WORKING!
      // can use CV as length of either SR = here is SRx
      //       - TESTED/working but not so satisfying for clvalue use

      SRlengthx=(clvalue>>11);
      if (SRlengthx<4) SRlengthx=4;
	
	if (shift_registerxl==0) shift_registerxl=0xff; // catch it!
	bitl= ((shift_registerxl >> (lfsr_taps_mirrored[SRlengthx][0])) ^ (shift_registerxl >> (lfsr_taps_mirrored[SRlengthx][1])) ^ (shift_registerxl >> (lfsr_taps_mirrored[SRlengthx][2])) ^ (shift_registerxl >> (lfsr_taps_mirrored[SRlengthx][3]))) & 1u; // 32 is 31, 29, 25, 24
	//	bitl= ((shift_registerx >> 31) ^ (shift_registerx >> 29) ^ (shift_registerx >> 25) ^ (shift_registerx >> 24)) & 1u; // 32 is 31, 29, 25, 24
	shift_registerxl = (shift_registerxl<<1) + bitl; // could or with incoming as we don't use this TESTY: shift_registerx = (shift_registerx<<1) + (bitl | !(GPIOB->IDR & 0x0040)); 

	if (bitl){ // calculate and output new bitl with void case_3 Turing Machine(void){
	  bitl = (shift_registerl>>SRlengthl) & 0x01; // bit which would be shifted out 
	  if (GPIOB->IDR & 0x0040) shift_registerl = (shift_registerl<<1) + bitl;
	  else shift_registerl = (shift_registerl<<1) + (!bitl);

	  if (bitl) GPIOB->BRR = 0b0010000000000000;  // clear PC13 else write one
	  else GPIOB->BSRR = 0b0010000000000000;  
	  if (shift_registerl & lengthbitl) GPIOB->BRR = 0b0100000000000000;  // clear PC14 else write one BRR is clear, BSRR is set bit and leave alone others
	  else GPIOB->BSRR = 0b0100000000000000;
	}
	}

    void case_31(void){ // was 58 -  change the shifting amount - sort of works but not a great range and we need to take care of length
      uint8_t bitl, shifter;
	  uint32_t clvalue;
	  if (modelpwm==0) clvalue=65536-ADCBuffer[3];  
	  else clvalue=ADCBuffer[3];

      shifter=(clvalue>>11)%(SRlengthl+1);
      if (shifter==0) shifter=1;
      // TM here
      bitl = (shift_registerl>>(SRlengthl-(shifter-1))) & (shifter); // bits which would be shifted out  // 1 for length of 31
      if (GPIOB->IDR & 0x0040) shift_registerl = (shift_registerl<<shifter) + bitl;
      else shift_registerl = (shift_registerl<<shifter) + (~bitl);

      if (bitl) GPIOB->BRR = 0b0010000000000000;  // clear PC13 else write one
      else GPIOB->BSRR = 0b0010000000000000;  
      if (shift_registerl & lengthbitl) GPIOB->BRR = 0b0100000000000000; 
      else GPIOB->BSRR = 0b0100000000000000;  
      }

    void case_16h(void){ // was 11 - leave in middle// MAYBE put this in middle of CV select mode for easy access TODO
    uint8_t bith;
    uint32_t cvalue;
    if (modehpwm==0) cvalue=65536-ADCBuffer[2];  // or modehpwm>1???TESTY!
    else cvalue=ADCBuffer[2];
      //->>>>>>>>>>>>>> CV selects length of SR which will stay with us .. -> LFSR here
      SRlengthh=31-(cvalue>>11);
      if (SRlengthh<4) SRlengthh=4;
      lengthbith=(1<<(SRlengthh/2));
      if (shift_registerh==0) shift_registerh=0xff;
      bith= ((shift_registerh >> (lfsr_taps[SRlengthh][0])) ^ (shift_registerh >> (lfsr_taps[SRlengthh][1])) ^ (shift_registerh >> (lfsr_taps[SRlengthh][2])) ^ (shift_registerh >> (lfsr_taps[SRlengthh][3]))) & 1u; // 32 is 31, 29, 25, 24
      shift_registerh = (shift_registerh<<1) + ((bith | !(GPIOB->IDR & 0x0400))); // PB7 and PB10

      if (bith) GPIOC->BRR = 0b0010000000000000;  // clear PC13 else write one
      else GPIOC->BSRR = 0b0010000000000000;  
      if (shift_registerh & lengthbith) GPIOC->BRR = 0b0100000000000000; 
      else GPIOC->BSRR = 0b0100000000000000;  
      }

    void case_17h(void){ // was 10
        uint8_t bith;
    uint32_t cvalue;
    if (modehpwm==0) cvalue=65536-ADCBuffer[2];  // or modehpwm>1???TESTY!
    else cvalue=ADCBuffer[2];
      //->>>>>>>>>>>>>> entry into SR from CV - TM = no input bit 
      hcount++;
      if (hcount>7) hcount=0;
      bith = (shift_registerh>>SRlengthh) & 0x01; // bit which would be shifted out
      
      if((cvalue>>(8+hcount))&1) shift_registerh = (shift_registerh<<1) + (!bith); // or we could & with input bit - TO TEST!
      else shift_registerh = (shift_registerh<<1) + bith;

      if (bith) GPIOC->BRR = 0b0010000000000000;  // clear PC13 else write one
      else GPIOC->BSRR = 0b0010000000000000; 
      if (shift_registerh & lengthbith) GPIOC->BRR = 0b0100000000000000; 
      else GPIOC->BSRR = 0b0100000000000000; 
      }
      
