microresearch/allcolours/software/STM32F103/src/stm32f10x_func_it.c
    void case_26h(void){ // was 50
        uint8_t bith;
    uint32_t cvalue;
    if (modehpwm==0) cvalue=65536-ADCBuffer[2];  // or modehpwm>1???TESTY!
    else cvalue=ADCBuffer[2];
      //->>>>>>>>>>>>>> Electronotes: CV selects which bits to set to 1 = chance of change
      // TESTED/WORKING!
      if (!(GPIOB->IDR & 0x0400)){
      bith = (shift_registerh>>SRlengthh) & 0x01; // bit which would be shifted out -
      probh=cvalue>>13; // 3 bits now for electroprob array
      probh=electroprob[probh];

      if (((probh | shift_registerl) & 0xff ) == 0xff) shift_registerh = (shift_registerh<<1) + ((shift_registerl>>SRlengthl) & 0x01); // new bits enter from shiftregleft - 0xff was looker[7]
      else shift_registerh = (shift_registerh<<1) + bith;

      if (bith) GPIOC->BRR = 0b0010000000000000;  // clear PC13 else write one
      else GPIOC->BSRR = 0b0010000000000000; 
      if (shift_registerh & lengthbith) GPIOC->BRR = 0b0100000000000000;  // clear PC14 else write one BRR is clear, BSRR is set bit and leave alone others
      else GPIOC->BSRR = 0b0100000000000000; 
      }
      }

    void case_27h(void){ // was 52
        uint8_t bith;
    uint32_t cvalue;
    if (modehpwm==0) cvalue=65536-ADCBuffer[2];  // or modehpwm>1???TESTY!
    else cvalue=ADCBuffer[2];
      //->>>>>>>>>>>>>> Electronotes: CV selects which bits to set to 1 = chance of change
      // TESTED/WORKING!
      if (!(GPIOB->IDR & 0x0400)){
      bith = (shift_registerh>>SRlengthh) & 0x01; // bit which would be shifted out -
      probh=cvalue>>13; // 3 bits now for electroprob array
      probh=electroprob[probh];

      if (((probh | shift_registerl) & 0xff ) == 0xff) shift_registerh = (shift_registerh<<1) + ((shift_registerl>>SRlengthl) & 0x01); // new bits enter from shiftregleft - 0xff was looker[7]
      else shift_registerh = (shift_registerh<<1) + bith;
      }
      
      if (bith) GPIOC->BRR = 0b0010000000000000;  // clear PC13 else write one
      else GPIOC->BSRR = 0b0010000000000000; 
      if (shift_registerh & lengthbith) GPIOC->BRR = 0b0100000000000000;  // clear PC14 else write one BRR is clear, BSRR is set bit and leave alone others
      else GPIOC->BSRR = 0b0100000000000000; 
      }

    void case_28h(void){ // was 53
        uint8_t bith;
    uint32_t cvalue;
    if (modehpwm==0) cvalue=65536-ADCBuffer[2];  // or modehpwm>1???TESTY!
    else cvalue=ADCBuffer[2];
      // - after void case_25 - SR loops within SR at certain points?/sizes determined by CV or pulses in = basic SR of OR with incoming bits
      // change and Re_test this - TESTED/working
      // loop bith back in XOR at certain point?
	bith = (shift_registerh>>SRlengthh) & 0x01; // bit which would be shifted out
	shift_registerh = (shift_registerh<<1);
	// do the loop back in
	hcount=cvalue>>11; // 5 bits - orh(void){ hcount=(cvalue>>11)%(SRlengthh+1);
	if (bith) shift_registerh ^= (1<<hcount);// set the xth bit
	shift_registerh ^= (!(GPIOB->IDR & 0x0400));
	
	if (bith) GPIOC->BRR = 0b0010000000000000;  // clear PC13 else write one
	else GPIOC->BSRR = 0b0010000000000000; 
	if (shift_registerh & lengthbith) GPIOC->BRR = 0b0100000000000000;  
	else GPIOC->BSRR = 0b0100000000000000; 
	}
	
    void case_29h(void){ // was 56
        uint8_t bith;
    uint32_t cvalue;
    if (modehpwm==0) cvalue=65536-ADCBuffer[2];  // or modehpwm>1???TESTY!
    else cvalue=ADCBuffer[2];
      // Independent LFSR clocking regular SR (only in CV as speed) - TESTED/WORKING!
      // can use CV as length of either SR = here is regularSR
      //       - TESTED/working
      SRlengthh=(cvalue>>11);
      if (SRlengthh<4) SRlengthh=4;
      lengthbith=(1<<(SRlengthh/2));
	
	if (shift_registerx==0) shift_registerx=0xff; // catch it!
	//	bith= ((shift_registerh >> (lfsr_taps[SRlengthh][0])) ^ (shift_registerh >> (lfsr_taps[SRlengthh][1])) ^ (shift_registerh >> (lfsr_taps[SRlengthh][2])) ^ (shift_registerh >> (lfsr_taps[SRlengthh][3]))) & 1u; // 32 is 31, 29, 25, 24
	bith= ((shift_registerx >> 31) ^ (shift_registerx >> 29) ^ (shift_registerx >> 25) ^ (shift_registerx >> 24)) & 1u; // 32 is 31, 29, 25, 24
	shift_registerx = (shift_registerx<<1) + bith; // could or with incoming as we don't use this TESTY: shift_registerx = (shift_registerx<<1) + (bith | !(GPIOB->IDR & 0x0400)); 

	if (bith){ // calculate and output new bith with void case_3 Turing Machineh(void){
	  bith = (shift_registerh>>SRlengthh) & 0x01; // bit which would be shifted out 
	  if (GPIOB->IDR & 0x0400) shift_registerh = (shift_registerh<<1) + bith;
	  else shift_registerh = (shift_registerh<<1) + (!bith);

	  if (bith) GPIOC->BRR = 0b0010000000000000;  // clear PC13 else write one
	  else GPIOC->BSRR = 0b0010000000000000;  
	  if (shift_registerh & lengthbith) GPIOC->BRR = 0b0100000000000000;  // clear PC14 else write one BRR is clear, BSRR is set bit and leave alone others
	  else GPIOC->BSRR = 0b0100000000000000;
	}
	}

    void case_30h(void){ // was 57
      uint8_t bith, SRlengthx;
      uint32_t cvalue;
    if (modehpwm==0) cvalue=65536-ADCBuffer[2];  // or modehpwm>1???TESTY!
    else cvalue=ADCBuffer[2];
      // Independent LFSR clocking regular SR (only in CV as speed) - TESTED/WORKING!
      // can use CV as length of either SR = here is SRx
      //       - TESTED/working but not so satisfying for cvalue use

      SRlengthx=(cvalue>>11);
      if (SRlengthx<4) SRlengthx=4;
	
	if (shift_registerx==0) shift_registerx=0xff; // catch it!
	bith= ((shift_registerx >> (lfsr_taps[SRlengthx][0])) ^ (shift_registerx >> (lfsr_taps[SRlengthx][1])) ^ (shift_registerx >> (lfsr_taps[SRlengthx][2])) ^ (shift_registerx >> (lfsr_taps[SRlengthx][3]))) & 1u; // 32 is 31, 29, 25, 24
	//	bith= ((shift_registerx >> 31) ^ (shift_registerx >> 29) ^ (shift_registerx >> 25) ^ (shift_registerx >> 24)) & 1u; // 32 is 31, 29, 25, 24
	shift_registerx = (shift_registerx<<1) + bith; // could or with incoming as we don't use this TESTY: shift_registerx = (shift_registerx<<1) + (bith | !(GPIOB->IDR & 0x0400)); 

	if (bith){ // calculate and output new bith with void case_3 Turing Machineh(void){
	  bith = (shift_registerh>>SRlengthh) & 0x01; // bit which would be shifted out 
	  if (GPIOB->IDR & 0x0400) shift_registerh = (shift_registerh<<1) + bith;
	  else shift_registerh = (shift_registerh<<1) + (!bith);

	  if (bith) GPIOC->BRR = 0b0010000000000000;  // clear PC13 else write one
	  else GPIOC->BSRR = 0b0010000000000000;  
	  if (shift_registerh & lengthbith) GPIOC->BRR = 0b0100000000000000;  // clear PC14 else write one BRR is clear, BSRR is set bit and leave alone others
	  else GPIOC->BSRR = 0b0100000000000000;
	}
	}

    void case_31h(void){ // was 58 -  change the shifting amount - sort of works but not a great range and we need to take care of length
      uint8_t bith, shifter;
    uint32_t cvalue;
    if (modehpwm==0) cvalue=65536-ADCBuffer[2];  // or modehpwm>1???TESTY!
    else cvalue=ADCBuffer[2];
      shifter=(cvalue>>11)%(SRlengthh+1);
      if (shifter==0) shifter=1;
      // TM here
      bith = (shift_registerh>>(SRlengthh-(shifter-1))) & (shifter); // bits which would be shifted out  // 1 for length of 31
      if (GPIOB->IDR & 0x0400) shift_registerh = (shift_registerh<<shifter) + bith;
      else shift_registerh = (shift_registerh<<shifter) + (~bith);

      if (bith) GPIOC->BRR = 0b0010000000000000;  // clear PC13 else write one
      else GPIOC->BSRR = 0b0010000000000000;  
      if (shift_registerh & lengthbith) GPIOC->BRR = 0b0100000000000000; 
      else GPIOC->BSRR = 0b0100000000000000;  
      }

void (*LF_TIM2_modes[16])(void)={case_0, case_1, case_2, case_3, case_4, case_5, case_6, case_7, case_8, case_9, case_10, case_11, case_12, case_13, case_14, case_15};
void (*HF_TIM2_modes[16])(void)={case_0h, case_1h, case_2h, case_3h, case_4h, case_5h, case_6h, case_7h, case_8h, case_9h, case_10h, case_11h, case_12h, case_13h, case_14h, case_15h};

void (*LF_INT_modes[16])(void)={case_16, case_17, case_18, case_19, case_20, case_21, case_22, case_23, case_24, case_25, case_26, case_27, case_28, case_29, case_30, case_31};
void (*HF_INT_modes[16])(void)={case_16h, case_17h, case_18h, case_19h, case_20h, case_21h, case_22h, case_23h, case_24h, case_25h, case_26h, case_27h, case_28h, case_29h, case_30h, case_31h};

