microresearch/allcolours/software/STM32F103/src/stm32f10x_func_it.c
void TIM2_IRQHandler(void){
  
  TIM_ClearITPendingBit(TIM2, TIM_IT_Update);

  if (modelsr<16) {
    counterl++;
    if (counterl>speedll){
    counterl=0;
    LF_TIM2_modes[modelsr]();
    }
  }

  if (modehsr<16){
    counterh++;
    if (counterh>speedhh){
      counterh=0;
      HF_TIM2_modes[modehsr]();
    }
  }
}
    
void TIM4_IRQHandler(void){
  uint32_t speedh, speedl;
  // select modes, speeds and if necessary handle PWM depending on mode. Speed from main.c is 1KHz
  TIM_ClearITPendingBit(TIM4, TIM_IT_Update);
    
  model=ADCBuffer[1];
  modeh=ADCBuffer[0];

  // so we have 32 modes for hpwm and 2 modes for pwm - do we need smoothings ->
  // tested with blank and no smoothing is necessary  

  modehpwm=modeh>>15; // 1 bits remaining
  modehsr=31-(modeh>>10)%32; // 32 modes

  speedh=logger[ADCBuffer[2]>>6]; // 1024  = 10 bits -> could be less logger to make smoother?
  if (modehpwm==0) {     // invert the speedhh;
    speedhh=logforSR[1024-(ADCBuffer[2]>>6)]; // or recalculate from log? TESTY!
  }
  else  speedhh=logforSR[ADCBuffer[2]>>6]; // 1024 option = 10 bits log ->  could be less logger to make smoother? - could also be a lot slower at one end

  //  modelpwm=1; // TESTY! 
  modelpwm=model>>15; // 1 bits remaining
  modelsr=31-(model>>10)%32; // 32 modes

  speedl=logger[ADCBuffer[3]>>6]; // 1024  = 10 bits -> could be less logger to make smoother?
  if (modelpwm==0) {     // invert the speedhh;
    speedll=logforSR[1024-(ADCBuffer[3]>>6)]; // or recalculate from log? TESTY!
  }
  else  speedll=logforSR[ADCBuffer[3]>>6]; // 1024 option = 10 bits log ->  could be less logger to make smoother? - could also be a lot slower at one end
  
  TIM1->ARR = speedh;//period
  TIM1->CCR1 = speedh/2; // pulse  
  TIM3->ARR = speedl;//period
  TIM3->CCR1 = speedl/2; // pulse  

}

void EXTI9_5_IRQHandler(void){
  // LF and HF pulse in on falling edges

  uint32_t pending = EXTI->PR;

  // --------------------LF pulse modes
  if(pending & (1 << 5)) { // LF on 5 out on B
    EXTI->PR = 1 << 5; // clear pending flag, otherwise we'd get endless interrupts -!!!!!!!!!!!!!!!!!!!!!!!!!        // handle pin 5 here

    if (modelsr>15){
      LF_INT_modes[modelsr]();
    }
  }

  // --------------------HF Pulse modes 
  if(pending & (1 << 7)) { // HF on 7/out on C
    EXTI->PR = 1 << 7;        // handle pin 7 here

    if (modehsr>15){
      HF_INT_modes[modehsr]();
    }
  }
}
